print('Вывод на консоль')
print ( 2022 )

name = 'Python'
autor = 'Гвидо ван Россум'
print ( name )
print ( autor )

print()
print('---------------')

print('Язык:',name,', автор:',autor,', год создания:',1991)

year = 1991
# использование f-строки
print(f'Язык: {name}, автор: {autor}, год создания: {year}')

print('1-я строка\n2-я строка')

print('\nАндерс Хейлсберг:\n"Не бывает хороших языков,\nбывают хорошие программисты".')

print('\n\nодин\tдва\t\tтри\nчетыре\tпять\tшесть\nсемь\tвосемь\tдевять\n\t\tдесять')
print('\\n\\nодин\\tдва\\t\\tтри\\nчетыре\\tпять\\tшесть\\nсемь\\tвосемь\\tдевять\\n\\t\\tдесять')
print(r'\n\nодин\tдва\t\tтри\nчетыре\tпять\tшесть\nсемь\tвосемь\tдевять\n\t\tдесять')

print('''
Однажды американский программист Питер Нортон сказал:
"Идеальному коду место в музее:
там ценят всякие древности"
''')

